app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    @student = Student.find(id: params[:id])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-12-15 19:52:59.891061"], ["updated_at", "2017-12-15 19:52:59.891061"]]
---
  def create
    @student = Student.new(check_params(:first_name,:last_name))
  	@student.save